a52dec
aalib
accounts-qml-module
accountsservice
acl
acpid
adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
adwaita-icon-theme
akonadi
akonadi-calendar
akonadi-calendar-tools
akonadi-contacts
akonadi-import-wizard
akonadi-mime
akonadi-notes
akonadi-search
akonadiconsole
akregator
albert
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
analitza
android-tools
android-udev
aom
apparmor
appimagelauncher
appstream
appstream-qt
arandr
archlinux-appstream-data
archlinux-keyring
archlinuxcn-keyring
argon2
ark
artikulate
at-spi2-atk
at-spi2-core
atk
attica
attr
audiocd-kio
audiofile
audit
autoconf
autojump
automake
avahi
avogadrolibs
baloo
baloo-widgets
base
bash
binutils
bison
black-hole-solver
blinken
bluedevil
blueman
bluez
bluez-libs
bluez-qt
bluez-utils
bolt
bomber
boost
boost-libs
botan
bovo
breeze
breeze-gtk
breeze-icons
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
calendarsupport
cantarell-fonts
cantor
cdparanoia
cervisia
cfitsio
chromaprint
cifs-utils
clang
clucene
cmake
colord
com.qq.tim.spark
compiler-rt
convertlit
coordgen
coreutils
cronie
cryptsetup
ctags
curl
dav1d
db
dbus
dbus-glib
dconf
deepin-desktop-base
deepin-qt-dbus-factory
deepin-qt5integration
deepin-qt5platform-plugins
deepin-screenshot
deepin-turbo
deepin-udis86
deepin-wine-helper
deepin-wine-plugin
deepin-wine-plugin-virtual
deepin-wine5
deepin-wine5-i386
desktop-file-utils
device-mapper
dialog
diffutils
ding-libs
discount
discover
djvulibre
dkms
dmraid
dnssec-anchors
docbook-xml
docbook-xsl
dolphin
dolphin-plugins
dosfstools
double-conversion
dragon
drkonqi
dtkcore
dtkgui
dtkwidget
dtkwm
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efivar
electron4-bin
elfutils
elisa
enchant
eventviews
exiv2
expat
faac
faad2
fakeroot
farstream
faudio
fcitx5-chewing
fcitx5-chinese-addons-git
fcitx5-configtool-git
fcitx5-git
fcitx5-gtk-git
fcitx5-material-color
fcitx5-pinyin-moegirl
fcitx5-pinyin-zhwiki
fcitx5-qt4-git
fcitx5-qt5-git
fcitx5-qt6-git
feh
ffmpeg
ffmpegthumbs
fftw
file
filelight
filesystem
findutils
flac
flameshot
flex
fluidsynth
fmt
fontconfig
frameworkintegration
freecell-solver
freetype2
frei0r-plugins
fribidi
fuse-common
fuse2
fuse3
gavl
gawk
gc
gcc
gcc-libs
gconf
gcr
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gettext
ghostscript
giflib
git
glew
glib-networking
glib2
glibc
glslang
glu
gmp
gnu-free-fonts
gnugo
gnupg
gnutls
gobject-introspection-runtime
google-chrome
gpgme
gpm
gptfdisk
granatier
grantlee
grantlee-editor
grantleetheme
graphene
graphite
grep
groff
grpc
grub
gsettings-desktop-schemas
gsettings-qt
gsl
gsm
gssdp
gssproxy
gst-libav
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gtest
gtk-update-icon-cache
gtk2
gtk3
guile
gupnp
gupnp-igd
gvfs
gvfs-afc
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
gwenview
gzip
harfbuzz
harfbuzz-icu
hdf5
hdparm
hicolor-icon-theme
hidapi
http-parser
hunspell
hwids
hwloc
hyphen
i3-gaps
i3exit
i3lock
i3lock-fancy-git
iana-etc
icu
id3lib
ijs
imagemagick
imlib2
incidenceeditor
inetutils
intel-ucode
inxi
iproute2
iptables
iputils
iso-codes
itinerary
iw
jack
jansson
jasper
jbig2dec
jemalloc
jfsutils
jq
js78
json-c
json-glib
jsoncpp
juk
k3b
kaccounts-integration
kaccounts-providers
kactivities
kactivities-stats
kactivitymanagerd
kaddressbook
kajongg
kalarm
kalarmcal
kalgebra
kalzium
kamera
kamoso
kanagram
kapman
kapptemplate
karchive
kate
katomic
kauth
kbackup
kbd
kblackbox
kblocks
kbookmarks
kbounce
kbreakout
kbruch
kcachegrind
kcachegrind-common
kcalc
kcalendarcore
kcalutils
kcharselect
kcmutils
kcodecs
kcolorchooser
kcolorpicker
kcompletion
kconfig
kconfigwidgets
kcontacts
kcoreaddons
kcrash
kcron
kdav
kdbusaddons
kde-cli-tools
kde-dev-scripts
kde-dev-utils
kde-gtk-config
kdebugsettings
kdeclarative
kdeconnect
kdecoration
kded
kdeedu-data
kdegraphics-mobipocket
kdegraphics-thumbnailers
kdelibs4support
kdenetwork-filesharing
kdenlive
kdepim-addons
kdepim-runtime
kdeplasma-addons
kdesdk-kioslaves
kdesdk-thumbnailers
kdesu
kdevelop
kdevelop-php
kdf
kdiagram
kdialog
kdiamond
kdnssd
kdoctools
kdsoap
kdsoap-ws-discovery-client
keditbookmarks
kemoticons
keyutils
kfilemetadata
kfind
kfloppy
kfourinline
kgamma5
kgeography
kget
kglobalaccel
kgoldrunner
kgpg
kguiaddons
khangman
khelpcenter
kholidays
khotkeys
khtml
ki18n
kiconthemes
kidentitymanagement
kidletime
kig
kigo
killbots
kimageannotator
kimagemapeditor
kimap
kinfocenter
kinit
kio
kio-extras
kio-gdrive
kipi-plugins
kirigami-gallery
kirigami2
kiriki
kitemmodels
kitemviews
kiten
kitinerary
kjobwidgets
kjs
kjumpingcube
kldap
kleopatra
klettres
klickety
klines
kmag
kmahjongg
kmail
kmail-account-wizard
kmailtransport
kmbox
kmenuedit
kmime
kmines
kmix
kmod
kmousetool
kmouth
kmplot
knavalbattle
knetwalk
knewstuff
knights
knotes
knotifications
knotifyconfig
kolf
kollision
kolourpaint
kompare
konqueror
konquest
konsole
kontact
kontactinterface
kontrast
konversation
kopete
korganizer
kosmindoormap
kpackage
kparts
kpatience
kpeople
kpeoplevcard
kpimtextedit
kpkpass
kplotting
kpmcore
kpty
kpublictransport
kqtquickcharts
kquickcharts
krb5
krdc
kreversi
krfb
kross
kross-interpreters
kruler
krunner
kscreen
kscreenlocker
kservice
kshisen
ksirk
ksmtp
ksnakeduel
kspaceduel
ksquares
ksshaskpass
ksudoku
ksysguard
ksystemlog
kteatime
ktexteditor
ktextwidgets
ktimer
ktnef
ktorrent
ktouch
ktuberling
kturtle
kubrick
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwalletmanager
kwave
kwayland
kwayland-integration
kwayland-server
kwidgetsaddons
kwin
kwindowsystem
kwordquiz
kwrite
kwrited
kxmlgui
l-smash
lame
latte-dock
lcms2
ldb
ldns
less
lib32-acl
lib32-alsa-lib
lib32-alsa-plugins
lib32-at-spi2-atk
lib32-at-spi2-core
lib32-atk
lib32-attr
lib32-brotli
lib32-bzip2
lib32-cairo
lib32-colord
lib32-curl
lib32-dbus
lib32-dconf
lib32-e2fsprogs
lib32-expat
lib32-faudio
lib32-flac
lib32-fontconfig
lib32-freetype2
lib32-fribidi
lib32-gcc-libs
lib32-gdk-pixbuf2
lib32-gettext
lib32-glib-networking
lib32-glib2
lib32-glibc
lib32-glu
lib32-gmp
lib32-gnutls
lib32-gst-plugins-base-libs
lib32-gstreamer
lib32-gtk3
lib32-harfbuzz
lib32-icu
lib32-json-glib
lib32-keyutils
lib32-krb5
lib32-lcms2
lib32-libasyncns
lib32-libcanberra
lib32-libcanberra-pulse
lib32-libcap
lib32-libcups
lib32-libdatrie
lib32-libdrm
lib32-libelf
lib32-libepoxy
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libgudev
lib32-libgusb
lib32-libice
lib32-libidn2
lib32-libjpeg-turbo
lib32-libjpeg6-turbo
lib32-libldap
lib32-libltdl
lib32-libnl
lib32-libnsl
lib32-libogg
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libproxy
lib32-libpsl
lib32-libpulse
lib32-librsvg
lib32-libsm
lib32-libsndfile
lib32-libsoup
lib32-libssh2
lib32-libtasn1
lib32-libthai
lib32-libtiff
lib32-libtirpc
lib32-libudev0-shim
lib32-libunistring
lib32-libunwind
lib32-libusb
lib32-libvorbis
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcomposite
lib32-libxcrypt
lib32-libxcursor
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxft
lib32-libxi
lib32-libxinerama
lib32-libxkbcommon
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxtst
lib32-libxv
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-mpg123
lib32-ncurses
lib32-nettle
lib32-ocl-icd
lib32-openal
lib32-openssl
lib32-orc
lib32-p11-kit
lib32-pam
lib32-pango
lib32-pcre
lib32-pixman
lib32-polkit
lib32-readline
lib32-rest
lib32-sdl2
lib32-sqlite
lib32-systemd
lib32-tdb
lib32-util-linux
lib32-vkd3d
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaccounts-glib
libaccounts-qt
libaec
libaio
libakonadi
libappimage
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavtp
libb2
libblockdev
libbluray
libbs2b
libbsd
libburn
libbytesize
libcaca
libcanberra
libcanberra-pulse
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libchewing
libcloudproviders
libcmis
libconfig
libcroco
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdmtx
libdrm
libdv
libdvbpsi
libdvdnav
libdvdread
libe-book
libebml
libebur128
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfakekey
libfdk-aac
libffi
libfontenc
libfreehand
libgcrypt
libgee
libgexiv2
libgit2
libglvnd
libgme
libgnomekbd
libgpg-error
libgphoto2
libgravatar
libgudev
libgusb
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libieee1284
libimagequant
libime-git
libimobiledevice
libindicator-gtk3
libinih
libinput
libinstpatch
libixion
libjpeg-turbo
libkate
libkcddb
libkcompactdisc
libkdcraw
libkdegames
libkdepim
libkeduvocdocument
libkexiv2
libkgapi
libkipi
libkleo
libkmahjongg
libkolabxml
libkomparediff2
libksane
libksba
libkscreen
libksieve
libksysguard
libktorrent
liblangtag
libldac
libldap
liblqr
liblrdf
libmad
libmatroska
libmbim
libmfx
libmicrodns
libmicrohttpd
libmm-glib
libmms
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmsym
libmtp
libmusicbrainz5
libmwaw
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnice
libnl
libnm
libnma
libnotify
libnsl
libnumbertext
libodfgen
libofa
libogg
libomxil-bellagio
libopenaptx
liborcus
libotr
libp11-kit
libpackagekit-glib
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libphonenumber
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient
libqalculate
libqmi
libqtxdg
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
libreoffice-fresh-zh-cn
librevenge
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsidplay
libsignon-glib
libsigsegv
libsm
libsndfile
libsodium
libsoup
libsoxr
libspectre
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libudev0-shim
libunistring
libunwind
libupnp
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libvisio
libvisual
libvncserver
libvorbis
libvpx
libwacom
libwebp
libwpd
libwpg
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-headers
llvm-libs
lm_sensors
lmdb
lokalize
lolcat
lpsolve
lsb-release
lshw
lskat
lsof
lua52
lvm2
lz4
lzo
m4
maeparser
mailcap
mailcommon
mailimporter
make
man-db
marble
marble-common
mariadb
mariadb-clients
mariadb-libs
markdownpart
mbedtls
mbox-importer
md4c
mdadm
media-player-info
mesa
messagelib
milou
minizip
minuet
mjpegtools
mkinitcpio
mkinitcpio-busybox
mlt
mobile-broadband-provider-info
modemmanager
modemmanager-qt
molequeue
moreutils
mpfr
mpg123
mtdev
mtools
nano
ncurses
ndctl
neofetch
neon
net-snmp
net-tools
netease-cloud-music
nettle
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
networkmanager-pptp
networkmanager-qt
networkmanager-vpnc
nfs-utils
nfsidmap
nm-connection-editor
node-gyp
nodejs
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
nss-mdns
ntfs-3g
nutstore
obs-studio
ocs-url
okular
oniguruma
openal
openbabel
opencc
openconnect
opencore-amr
openexr
openjpeg2
openmpi
openresolv
openssh
openssl
openssl-1.0
openvpn
opus
orc
os-prober
oxygen
p11-kit
p7zip
package-query
packagekit
packagekit-qt5
pacman
pacman-mirrorlist
palapeli
pam
pambase
pango
parley
parted
partitionmanager
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-file-which
perl-io-tty
perl-ipc-run
perl-mailtools
perl-time-duration
perl-timedate
phonon-qt5
phonon-qt5-gstreamer
picmi
picom
pim-data-exporter
pim-sieve-editor
pimcommon
pinentry
pipewire
pixman
pkcs11-helper
pkgconf
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-framework
plasma-integration
plasma-nm
plasma-pa
plasma-sdk
plasma-thunderbolt
plasma-vault
plasma-workspace
plasma-workspace-wallpapers
polkit
polkit-kde-agent
polkit-qt5
polybar
poppler
poppler-glib
poppler-qt5
popt
portaudio
potrace
powerdevil
poxml
ppp
pptpclient
print-manager
prison
procps-ng
protobuf
psmisc
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pulseaudio-qt
purpose
python
python-appdirs
python-asn1crypto
python-attrs
python-automat
python-beautifulsoup4
python-cachecontrol
python-cairo
python-cffi
python-chardet
python-click
python-colorama
python-configobj
python-constantly
python-contextlib2
python-cryptography
python-dbus
python-dbus-common
python-decorator
python-distlib
python-distro
python-gobject
python-html5lib
python-httplib2
python-hyperlink
python-idna
python-incremental
python-lxml
python-msgpack
python-ordered-set
python-packaging
python-pep517
python-pillow
python-pip
python-ply
python-progress
python-psutil
python-pycparser
python-pycurl
python-pyhamcrest
python-pyopenssl
python-pyparsing
python-pyqt5
python-pyqt5-sip
python-pyte
python-requests
python-resolvelib
python-retrying
python-setuptools
python-six
python-soupsieve
python-toml
python-twisted
python-urllib3
python-wcwidth
python-webencodings
python-zope-interface
qca
qcef
qgpgme
qhull
qqc2-desktop-style
qqmusic-bin
qrencode
qt-gstreamer
qt4
qt5-base
qt5-charts
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-networkauth
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-webkit
qt5-x11extras
qt5-xmlpatterns
qt6-base
quazip
qv2ray
ranger
raptor
rasqal
rav1e
re2
readline
redland
reflector
rest
rhash
rocs
rpcbind
rsync
rtkit
rtmpdump
rttr
ruby
ruby-diff-lcs
ruby-irb
ruby-manpages
ruby-optimist
ruby-paint
ruby-rainbow
ruby-rdoc
ruby-reline
ruby-rspec
ruby-rspec-core
ruby-rspec-expectations
ruby-rspec-mocks
ruby-rspec-support
ruby-term-ansicolor
ruby-tins
rubygems
run-parts
rxvt-unicode
rxvt-unicode-terminfo
sane
sbc
sddm
sddm-kcm
sdl
sdl2
sed
semver
serd
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
smartmontools
smbclient
snappy
socat
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spectacle
speex
speexdsp
spglib
spirv-tools
sqlite
squashfuse
sratom
srt
startup-notification
step
stoken
sublime-text-dev
sudo
svgpart
svt-hevc
sweeper
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
systemsettings
t1lib
taglib
talloc
tar
tdb
telepathy-accounts-signon
telepathy-farstream
telepathy-glib
telepathy-kde-accounts-kcm
telepathy-kde-approver
telepathy-kde-auth-handler
telepathy-kde-call-ui
telepathy-kde-common-internals
telepathy-kde-contact-list
telepathy-kde-contact-runner
telepathy-kde-desktop-applets
telepathy-kde-filetransfer-handler
telepathy-kde-integration-module
telepathy-kde-send-file
telepathy-kde-text-ui
telepathy-logger
telepathy-logger-qt
telepathy-mission-control
telepathy-qt
tevent
texinfo
texlive-bibtexextra
texlive-bin
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-langchinese
texlive-langcyrillic
texlive-langextra
texlive-langgreek
texlive-langjapanese
texlive-langkorean
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
texstudio
thefuck
thin-provisioning-tools
threadweaver
thunderbird
timeshift
tlp
tlp-rdw
tracker3
transcode
tree
tslib
ttf-dejavu
ttf-droid
ttf-font-awesome
ttf-hack
ttf-inconsolata
ttf-indic-otf
ttf-liberation
ttf-ms-fonts
ttf-sarasa-gothic
ttf-wps-fonts
twolame
typora
tzdata
udisks2
umbrello
unicode-cldr-annotations
upower
urxvt-perls
usbmuxd
usbutils
util-linux
util-linux-libs
v2ray
v2ray-domain-list-community
v2ray-geoip
v4l-utils
variety
vi
vid.stab
vim
vim-runtime
virtualbox
virtualbox-host-dkms
visual-studio-code-insiders-bin
vlc
vmaf
volume_key
vpnc
vte-common
vte3
vtk
vulkan-icd-loader
wavpack
wayland
wayland-protocols
webrtc-audio-processing
wechat-uos
wget
which
wildmidi
wine
wine-gecko
wine-mono
wireless_tools
woff2
wpa_supplicant
wps-office-cn
wps-office-fonts
wps-office-mime-cn
wps-office-mui-zh-cn
wqy-microhei
wqy-zenhei
x264
x265
xapian-core
xapp
xcb-imdkit-git
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xdg-desktop-portal-kde
xdg-utils
xerces-c
xf86-input-libinput
xf86-video-vesa
xfsprogs
xkeyboard-config
xmlsec
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-alias-100dpi
xorg-fonts-alias-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-util-macros
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmessage
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xsel
xsettingsd
xvidcore
xxhash
xz
yajl
yakuake
yaourt
yay
zbar
zeroconf-ioslave
zeromq
zita-alsa-pcmi
zita-resampler
zlib
zsh
zstd
zvbi
zxing-cpp
zziplib
