acpid
adobe-source-han-sans-cn-fonts
akonadi-calendar-tools
akonadi-import-wizard
akonadiconsole
akregator
albert
alsa-firmware
alsa-utils
android-tools
android-udev
apparmor
appimagelauncher
arandr
archlinuxcn-keyring
ark
artikulate
audiocd-kio
autoconf
autojump
automake
base
binutils
bison
blinken
bluedevil
blueman
bluez-utils
bomber
bovo
breeze
breeze-gtk
cantor
cervisia
com.qq.tim.spark
ctags
deepin-screenshot
dialog
discover
dolphin
dolphin-plugins
dosfstools
dragon
drkonqi
efibootmgr
electron4-bin
elisa
fakeroot
fcitx5-chewing
fcitx5-chinese-addons-git
fcitx5-configtool-git
fcitx5-git
fcitx5-gtk-git
fcitx5-material-color
fcitx5-pinyin-moegirl
fcitx5-pinyin-zhwiki
fcitx5-qt4-git
fcitx5-qt5-git
fcitx5-qt6-git
feh
ffmpegthumbs
filelight
flameshot
flex
gcc
git
google-chrome
granatier
grantlee-editor
groff
grub
gst-libav
gst-plugins-ugly
gvfs
gvfs-afc
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
gwenview
i3-gaps
i3exit
i3lock
i3lock-fancy-git
inetutils
intel-ucode
inxi
itinerary
jfsutils
juk
k3b
kactivitymanagerd
kaddressbook
kajongg
kalarm
kalgebra
kalzium
kamera
kamoso
kanagram
kapman
kapptemplate
kate
katomic
kbackup
kblackbox
kblocks
kbounce
kbreakout
kbruch
kcachegrind
kcalc
kcharselect
kcolorchooser
kcron
kde-cli-tools
kde-dev-scripts
kde-dev-utils
kde-gtk-config
kdebugsettings
kdeconnect
kdecoration
kdegraphics-mobipocket
kdegraphics-thumbnailers
kdenetwork-filesharing
kdenlive
kdepim-addons
kdeplasma-addons
kdesdk-kioslaves
kdesdk-thumbnailers
kdf
kdialog
kdiamond
keditbookmarks
kfind
kfloppy
kfourinline
kgamma5
kgeography
kget
kgoldrunner
kgpg
khangman
khelpcenter
khotkeys
kig
kigo
killbots
kimagemapeditor
kinfocenter
kio-extras
kio-gdrive
kipi-plugins
kirigami-gallery
kiriki
kiten
kjumpingcube
kleopatra
klettres
klickety
klines
kmag
kmahjongg
kmail
kmail-account-wizard
kmenuedit
kmines
kmix
kmousetool
kmouth
kmplot
knavalbattle
knetwalk
knights
knotes
kolf
kollision
kolourpaint
kompare
konqueror
konquest
konsole
kontact
kontrast
konversation
kopete
korganizer
kpatience
krdc
kreversi
krfb
kross-interpreters
kruler
kscreen
kscreenlocker
kshisen
ksirk
ksnakeduel
kspaceduel
ksquares
ksshaskpass
ksudoku
ksysguard
ksystemlog
kteatime
ktimer
ktorrent
ktouch
ktuberling
kturtle
kubrick
kwallet-pam
kwalletmanager
kwave
kwayland-integration
kwayland-server
kwin
kwordquiz
kwrite
kwrited
latte-dock
libime-git
libkscreen
libksysguard
libreoffice-fresh
libreoffice-fresh-zh-cn
libtool
linux
linux-firmware
linux-headers
lokalize
lolcat
lskat
m4
make
marble
markdownpart
mbox-importer
milou
minuet
mtools
nano
neofetch
net-tools
netease-cloud-music
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
networkmanager-pptp
networkmanager-vpnc
nfs-utils
nodejs
noto-fonts-cjk
noto-fonts-emoji
npm
nss-mdns
ntfs-3g
nutstore
obs-studio
ocs-url
okular
openresolv
os-prober
oxygen
packagekit-qt5
palapeli
parley
partitionmanager
patch
picmi
picom
pim-data-exporter
pim-sieve-editor
pkgconf
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-integration
plasma-nm
plasma-pa
plasma-sdk
plasma-thunderbolt
plasma-vault
plasma-workspace
plasma-workspace-wallpapers
polkit-kde-agent
polybar
powerdevil
poxml
print-manager
pulseaudio-alsa
pulseaudio-bluetooth
python-pip
qcef
qqmusic-bin
qv2ray
ranger
reflector
rocs
sddm
sddm-kcm
signon-kwallet-extension
sof-firmware
spectacle
step
sublime-text-dev
sudo
svgpart
sweeper
systemsettings
telepathy-kde-accounts-kcm
telepathy-kde-approver
telepathy-kde-auth-handler
telepathy-kde-call-ui
telepathy-kde-common-internals
telepathy-kde-contact-list
telepathy-kde-contact-runner
telepathy-kde-desktop-applets
telepathy-kde-filetransfer-handler
telepathy-kde-integration-module
telepathy-kde-send-file
telepathy-kde-text-ui
texinfo
texlive-bibtexextra
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-langchinese
texlive-langcyrillic
texlive-langextra
texlive-langgreek
texlive-langjapanese
texlive-langkorean
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
texstudio
thefuck
thunderbird
timeshift
tlp
tlp-rdw
transcode
tree
ttf-dejavu
ttf-droid
ttf-font-awesome
ttf-inconsolata
ttf-indic-otf
ttf-liberation
ttf-ms-fonts
ttf-sarasa-gothic
ttf-wps-fonts
typora
umbrello
urxvt-perls
v2ray
variety
vi
vim
virtualbox
visual-studio-code-insiders-bin
wechat-uos
wget
which
wine
wireless_tools
wpa_supplicant
wps-office-cn
wps-office-fonts
wps-office-mime-cn
wps-office-mui-zh-cn
wqy-microhei
wqy-zenhei
xdg-desktop-portal-kde
xf86-video-vesa
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xsettingsd
yakuake
yaourt
yay
zeroconf-ioslave
zsh
